[
    {
        "id" : "delorean-dash", "name" : "DeLorean Dash", "vid" : "deloreandash.mp4", "img": "deloreandash.png",
        "intro" : "One of the larger projects I've done, DeLorean Dash is a racing game. It is a gravity-defying synthwave-inspired racer, in which you race against your previous best record. With a group consisting of 3 developers and 3 artists, we had to communicate a lot, and work with GIT correctly.",
        "desc" : "How do you make a racing game fun? This was the question we were facing when we started working on what would become 'DeLorean Dash'. We ended up thinking of an idea where the player would have no real sense of what was up and what was down. The car would be able to drive on walls and ceilings, effectively making everything a floor.<br>We also came up with a gravity flip system where the car would have to flip to stay on the track. Players can race against their own ghost of their personal best, and keep getting better.",
        "mywork" : [
            "Personal Best",
            "Ghost",
            "UI & Menu's",
            "Camera Movement",
            "Checkpoints"
        ]
    },
    {
        "id" : "ball-game", "name" : "Untitled Ball Game", "vid" : "", "img": "",
        "intro" : "A small game I made for fun, based off of a game called 'Suika Game'. You drop different kind of objects from ball games (think of footballs and soccer balls) which merge into a larger object when colliding with an identical object.",
        "desc" : "Remaking a game looks easy, and sometimes is. I made this game in a couple of days, and while it isn't bug-free, I'm satisfied with the result.<br>The idea for this game randomly came to me, and I don't really know why, but I immediately felt like making it. So I did, and it was fun.",
        "mywork" : [
            "Object Merging",
            "Line of Death"
        ]
    },
    {
        "id" : "twinstick", "name" : "TwinStick", "vid" : "", "img": "",
        "intro" : "The first game I finished, TwinStick is a top down shooter. With a group that was a little bit dramatic, we still ended up with a pretty good game. It's a game where you control a good robot. You need to find keycards to retrieve the files that are on the top floor. Finding these keycards will allow you to open new doors, but watch out! Your enemies also have robots in this building, surveilling the area, and they are not afraid to kill to defend their secrets.",
        "desc" : "TwinStick is, as the name suggests, a game where you use both joysticks (or WASD/arrow keys + mouse). We only had support for mouse + keyboard, but the concept was the same thing. You would need to find all the keycards in the level before moving on to the next level. In these levels would be enemies patrolling, and they will try to stop you.<br>Finding new guns can allow you to get through the levels faster, and will make the game easier at that. But don't worry, as you make progress in the game, the enemies will also become stronger.",
        "mywork" : [
            "Player Movement",
            "Enemy Behavior",
            "Keycard System",
            "Level Transitions",
            "UI & Menu's"
        ]
    },
    {
        "id" : "qoute", "name" : "Qoute", "vid" : "", "img": "",
        "intro" : "Have you ever wanted to store quotes from your friends or colleagues in a small database? Well, I've made a Discord bot which makes it super easy to do just that! A super easy system that makes storing a quote, together with its year of origin and quoted easy and quick.",
        "desc" : "This project came a bit out of the blue for me, but in a server with my friends we have a 'quotes' channel. In this channel, as becomes pretty clear from the name, we store quotes of everyone. But at some point the pins got full, so I decided I would make a small Discord bot that worked for this.<br>It was a small project, but nonetheless fun. It was about a weeks worth of work, which was at school and at home as well. It's now on a virtual machine at my home, however the machine resets itself a lot and I don't bother checking on it enough.<br>The bot contains 5 functions: 'add-quote', 'get-quote', 'all-quotes', 'update-quote' and 'delete-quote'. Most of them do exactly as they sound, but 'get-quote' has some specific parameters that can define how the bot searches. It can be used with 0 parameters, which will return a random quote. It can be used with an id as parameter, which will return the quote with the given id. It can also be used with a query as parameter, which will return a random quote which contains the query.",
        "mywork" : [
            "Store in Database",
            "Get from Database",
            "Update",
            "Delete"
        ]
    },
    {
        "id" : "npc-system", "name" : "NPC System", "vid" : "", "img": "",
        "intro" : "",
        "desc" : "",
        "mywork" : [
            ""
        ]
    },
    {
        "id" : "metronome-labyrinth", "name" : "Metronome Labyrinth", "vid" : "", "img": "",
        "intro" : "A game jam with the theme: Metronome! I thought it would be pretty cool to make a moving labyrinth where the player moves on the beat, like in Crypt of the Necrodancer. It wasn't completely done before time was over, but I was honestly pretty satisfied with how far I got with the limited time.",
        "desc" : "While brainstorming I thought about 'Crypt of the Necrodancer', but how would I make it not a full-on knock-off? But then, suddenly Labyrinth the board game popped in my head, and I thought it would be pretty cool if the labyrinth would change every so often, instead of a player moving it.<br>In the end, I didn't get to completely implement that, it can only push 1 column down. Something that was also not done was my original plan of a randomized labyrinth at the start of the level, as it was too much work. Overall it was a pretty nice project, which I enjoyed.",
        "mywork" : [
            "Player Movement",
            "Movement Buffering",
            "Metronome Sound",
            "Labyrinth Move"
        ]
    }
]
